app/controllers/cools_controller.rb

  def index
    @cools = Cool.all
---
SELECT "cools".* FROM "cools"

  def show
    @cool = Cool.find(params[:id])
---
SELECT  "cools".* FROM "cools" WHERE "cools"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @cool = Cool.find(params[:id])
---
SELECT  "cools".* FROM "cools" WHERE "cools"."id" = ? LIMIT 1  [["id", 1]]

  def create
     @cool = Cool.new(cool_params)

     @cool.save
---
INSERT INTO "cools" ("pokemon", "trainer", "type1", "type2", "move1", "move2", "move3", "move4", "weakness1", "weakness2", "evolution1", "evolution2", "evolution3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @cool = Cool.find(params[:id])

    if @cool.update(cool_params)
---
SELECT  "cools".* FROM "cools" WHERE "cools"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cools" SET "pokemon" = ?, "updated_at" = ? WHERE "cools"."id" = ?  [["pokemon", "col"], ["updated_at", "2015-03-13 04:27:13.300890"], ["id", 1]]