app/controllers/smarts_controller.rb

SELECT "smarts".* FROM "smarts"
---
  def index
    @smarts = Smart.all

SELECT  "smarts".* FROM "smarts" WHERE "smarts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @smart = Smart.find(params[:id])

SELECT  "smarts".* FROM "smarts" WHERE "smarts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @smart = Smart.find(params[:id])

INSERT INTO "smarts" ("pokemon", "trainer", "type1", "type2", "move1", "move2", "move3", "move4", "weakness1", "weakness2", "evolution1", "evolution2", "evolution3", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
     @smart = Smart.new(smart_params)

     @smart.save

SELECT  "smarts".* FROM "smarts" WHERE "smarts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "smarts" SET "pokemon" = ?, "updated_at" = ? WHERE "smarts"."id" = ?  [["pokemon", "qwas"], ["updated_at", "2015-06-01 15:28:13.926462"], ["id", 2]]
---
  def update
    @smart = Smart.find(params[:id])

    if @smart.update(smart_params)